bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/hbn_reg.h
/**
  ******************************************************************************
  * @file    hbn_reg.h
  * @version V1.0
  * @date    2022-06-29
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef  __HBN_REG_H__
#define  __HBN_REG_H__

#include "bl702l.h"

/* 0x0 : HBN_CTL */
#define HBN_CTL_OFFSET                                          (0x0)
#define HBN_RTC_CTL                                             HBN_RTC_CTL
#define HBN_RTC_CTL_POS                                         (0U)
#define HBN_RTC_CTL_LEN                                         (4U)
#define HBN_RTC_CTL_MSK                                         (((1U<<HBN_RTC_CTL_LEN)-1)<<HBN_RTC_CTL_POS)
#define HBN_RTC_CTL_UMSK                                        (~(((1U<<HBN_RTC_CTL_LEN)-1)<<HBN_RTC_CTL_POS))
#define HBN_MODE                                                HBN_MODE
#define HBN_MODE_POS                                            (7U)
#define HBN_MODE_LEN                                            (1U)
#define HBN_MODE_MSK                                            (((1U<<HBN_MODE_LEN)-1)<<HBN_MODE_POS)
#define HBN_MODE_UMSK                                           (~(((1U<<HBN_MODE_LEN)-1)<<HBN_MODE_POS))
#define HBN_TRAP_MODE                                           HBN_TRAP_MODE
#define HBN_TRAP_MODE_POS                                       (8U)
#define HBN_TRAP_MODE_LEN                                       (1U)
#define HBN_TRAP_MODE_MSK                                       (((1U<<HBN_TRAP_MODE_LEN)-1)<<HBN_TRAP_MODE_POS)
#define HBN_TRAP_MODE_UMSK                                      (~(((1U<<HBN_TRAP_MODE_LEN)-1)<<HBN_TRAP_MODE_POS))
#define HBN_PWRDN_HBN_CORE                                      HBN_PWRDN_HBN_CORE
#define HBN_PWRDN_HBN_CORE_POS                                  (9U)
#define HBN_PWRDN_HBN_CORE_LEN                                  (1U)
#define HBN_PWRDN_HBN_CORE_MSK                                  (((1U<<HBN_PWRDN_HBN_CORE_LEN)-1)<<HBN_PWRDN_HBN_CORE_POS)
#define HBN_PWRDN_HBN_CORE_UMSK                                 (~(((1U<<HBN_PWRDN_HBN_CORE_LEN)-1)<<HBN_PWRDN_HBN_CORE_POS))
#define HBN_PWRDN_HBN_RTC                                       HBN_PWRDN_HBN_RTC
#define HBN_PWRDN_HBN_RTC_POS                                   (11U)
#define HBN_PWRDN_HBN_RTC_LEN                                   (1U)
#define HBN_PWRDN_HBN_RTC_MSK                                   (((1U<<HBN_PWRDN_HBN_RTC_LEN)-1)<<HBN_PWRDN_HBN_RTC_POS)
#define HBN_PWRDN_HBN_RTC_UMSK                                  (~(((1U<<HBN_PWRDN_HBN_RTC_LEN)-1)<<HBN_PWRDN_HBN_RTC_POS))
#define HBN_SW_RST                                              HBN_SW_RST
#define HBN_SW_RST_POS                                          (12U)
#define HBN_SW_RST_LEN                                          (1U)
#define HBN_SW_RST_MSK                                          (((1U<<HBN_SW_RST_LEN)-1)<<HBN_SW_RST_POS)
#define HBN_SW_RST_UMSK                                         (~(((1U<<HBN_SW_RST_LEN)-1)<<HBN_SW_RST_POS))
#define HBN_DIS_PWR_OFF_LDO11                                   HBN_DIS_PWR_OFF_LDO11
#define HBN_DIS_PWR_OFF_LDO11_POS                               (13U)
#define HBN_DIS_PWR_OFF_LDO11_LEN                               (1U)
#define HBN_DIS_PWR_OFF_LDO11_MSK                               (((1U<<HBN_DIS_PWR_OFF_LDO11_LEN)-1)<<HBN_DIS_PWR_OFF_LDO11_POS)
#define HBN_DIS_PWR_OFF_LDO11_UMSK                              (~(((1U<<HBN_DIS_PWR_OFF_LDO11_LEN)-1)<<HBN_DIS_PWR_OFF_LDO11_POS))
#define HBN_DIS_PWR_OFF_LDO11_RT                                HBN_DIS_PWR_OFF_LDO11_RT
#define HBN_DIS_PWR_OFF_LDO11_RT_POS                            (14U)
#define HBN_DIS_PWR_OFF_LDO11_RT_LEN                            (1U)
#define HBN_DIS_PWR_OFF_LDO11_RT_MSK                            (((1U<<HBN_DIS_PWR_OFF_LDO11_RT_LEN)-1)<<HBN_DIS_PWR_OFF_LDO11_RT_POS)
#define HBN_DIS_PWR_OFF_LDO11_RT_UMSK                           (~(((1U<<HBN_DIS_PWR_OFF_LDO11_RT_LEN)-1)<<HBN_DIS_PWR_OFF_LDO11_RT_POS))
#define HBN_PU_LDO14_AON                                        HBN_PU_LDO14_AON
#define HBN_PU_LDO14_AON_POS                                    (15U)
#define HBN_PU_LDO14_AON_LEN                                    (1U)
#define HBN_PU_LDO14_AON_MSK                                    (((1U<<HBN_PU_LDO14_AON_LEN)-1)<<HBN_PU_LDO14_AON_POS)
#define HBN_PU_LDO14_AON_UMSK                                   (~(((1U<<HBN_PU_LDO14_AON_LEN)-1)<<HBN_PU_LDO14_AON_POS))
#define HBN_SW_FORCE_LDO14_OFF                                  HBN_SW_FORCE_LDO14_OFF
#define HBN_SW_FORCE_LDO14_OFF_POS                              (16U)
#define HBN_SW_FORCE_LDO14_OFF_LEN                              (1U)
#define HBN_SW_FORCE_LDO14_OFF_MSK                              (((1U<<HBN_SW_FORCE_LDO14_OFF_LEN)-1)<<HBN_SW_FORCE_LDO14_OFF_POS)
#define HBN_SW_FORCE_LDO14_OFF_UMSK                             (~(((1U<<HBN_SW_FORCE_LDO14_OFF_LEN)-1)<<HBN_SW_FORCE_LDO14_OFF_POS))
#define HBN_SW_FORCE_DCDC_OFF                                   HBN_SW_FORCE_DCDC_OFF
#define HBN_SW_FORCE_DCDC_OFF_POS                               (17U)
#define HBN_SW_FORCE_DCDC_OFF_LEN                               (1U)
#define HBN_SW_FORCE_DCDC_OFF_MSK                               (((1U<<HBN_SW_FORCE_DCDC_OFF_LEN)-1)<<HBN_SW_FORCE_DCDC_OFF_POS)
#define HBN_SW_FORCE_DCDC_OFF_UMSK                              (~(((1U<<HBN_SW_FORCE_DCDC_OFF_LEN)-1)<<HBN_SW_FORCE_DCDC_OFF_POS))
#define HBN_LDO11_AON_VOUT_SEL                                  HBN_LDO11_AON_VOUT_SEL
#define HBN_LDO11_AON_VOUT_SEL_POS                              (19U)
#define HBN_LDO11_AON_VOUT_SEL_LEN                              (4U)
#define HBN_LDO11_AON_VOUT_SEL_MSK                              (((1U<<HBN_LDO11_AON_VOUT_SEL_LEN)-1)<<HBN_LDO11_AON_VOUT_SEL_POS)
#define HBN_LDO11_AON_VOUT_SEL_UMSK                             (~(((1U<<HBN_LDO11_AON_VOUT_SEL_LEN)-1)<<HBN_LDO11_AON_VOUT_SEL_POS))
#define HBN_PU_DCDC_AON                                         HBN_PU_DCDC_AON
#define HBN_PU_DCDC_AON_POS                                     (23U)
#define HBN_PU_DCDC_AON_LEN                                     (1U)
#define HBN_PU_DCDC_AON_MSK                                     (((1U<<HBN_PU_DCDC_AON_LEN)-1)<<HBN_PU_DCDC_AON_POS)
#define HBN_PU_DCDC_AON_UMSK                                    (~(((1U<<HBN_PU_DCDC_AON_LEN)-1)<<HBN_PU_DCDC_AON_POS))
#define HBN_RTC_DLY_OPTION                                      HBN_RTC_DLY_OPTION
#define HBN_RTC_DLY_OPTION_POS                                  (24U)
#define HBN_RTC_DLY_OPTION_LEN                                  (1U)
#define HBN_RTC_DLY_OPTION_MSK                                  (((1U<<HBN_RTC_DLY_OPTION_LEN)-1)<<HBN_RTC_DLY_OPTION_POS)
#define HBN_RTC_DLY_OPTION_UMSK                                 (~(((1U<<HBN_RTC_DLY_OPTION_LEN)-1)<<HBN_RTC_DLY_OPTION_POS))
#define HBN_PWR_ON_OPTION                                       HBN_PWR_ON_OPTION
#define HBN_PWR_ON_OPTION_POS                                   (25U)
#define HBN_PWR_ON_OPTION_LEN                                   (1U)
#define HBN_PWR_ON_OPTION_MSK                                   (((1U<<HBN_PWR_ON_OPTION_LEN)-1)<<HBN_PWR_ON_OPTION_POS)
#define HBN_PWR_ON_OPTION_UMSK                                  (~(((1U<<HBN_PWR_ON_OPTION_LEN)-1)<<HBN_PWR_ON_OPTION_POS))
#define HBN_SRAM_SLP_OPTION                                     HBN_SRAM_SLP_OPTION
#define HBN_SRAM_SLP_OPTION_POS                                 (26U)
#define HBN_SRAM_SLP_OPTION_LEN                                 (1U)
#define HBN_SRAM_SLP_OPTION_MSK                                 (((1U<<HBN_SRAM_SLP_OPTION_LEN)-1)<<HBN_SRAM_SLP_OPTION_POS)
#define HBN_SRAM_SLP_OPTION_UMSK                                (~(((1U<<HBN_SRAM_SLP_OPTION_LEN)-1)<<HBN_SRAM_SLP_OPTION_POS))
#define HBN_SRAM_SLP                                            HBN_SRAM_SLP
#define HBN_SRAM_SLP_POS                                        (27U)
#define HBN_SRAM_SLP_LEN                                        (1U)
#define HBN_SRAM_SLP_MSK                                        (((1U<<HBN_SRAM_SLP_LEN)-1)<<HBN_SRAM_SLP_POS)
#define HBN_SRAM_SLP_UMSK                                       (~(((1U<<HBN_SRAM_SLP_LEN)-1)<<HBN_SRAM_SLP_POS))
#define HBN_STATE                                               HBN_STATE
#define HBN_STATE_POS                                           (28U)
#define HBN_STATE_LEN                                           (4U)
#define HBN_STATE_MSK                                           (((1U<<HBN_STATE_LEN)-1)<<HBN_STATE_POS)
#define HBN_STATE_UMSK                                          (~(((1U<<HBN_STATE_LEN)-1)<<HBN_STATE_POS))

/* 0x4 : HBN_TIME_L */
#define HBN_TIME_L_OFFSET                                       (0x4)
#define HBN_TIME_L                                              HBN_TIME_L
#define HBN_TIME_L_POS                                          (0U)
#define HBN_TIME_L_LEN                                          (32U)
#define HBN_TIME_L_MSK                                          (((1U<<HBN_TIME_L_LEN)-1)<<HBN_TIME_L_POS)
#define HBN_TIME_L_UMSK                                         (~(((1U<<HBN_TIME_L_LEN)-1)<<HBN_TIME_L_POS))

