bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/hbn_reg.h
/* 0x8 : HBN_TIME_H */
#define HBN_TIME_H_OFFSET                                       (0x8)
#define HBN_TIME_H                                              HBN_TIME_H
#define HBN_TIME_H_POS                                          (0U)
#define HBN_TIME_H_LEN                                          (8U)
#define HBN_TIME_H_MSK                                          (((1U<<HBN_TIME_H_LEN)-1)<<HBN_TIME_H_POS)
#define HBN_TIME_H_UMSK                                         (~(((1U<<HBN_TIME_H_LEN)-1)<<HBN_TIME_H_POS))

/* 0xC : RTC_TIME_L */
#define HBN_RTC_TIME_L_OFFSET                                   (0xC)
#define HBN_RTC_TIME_LATCH_L                                    HBN_RTC_TIME_LATCH_L
#define HBN_RTC_TIME_LATCH_L_POS                                (0U)
#define HBN_RTC_TIME_LATCH_L_LEN                                (32U)
#define HBN_RTC_TIME_LATCH_L_MSK                                (((1U<<HBN_RTC_TIME_LATCH_L_LEN)-1)<<HBN_RTC_TIME_LATCH_L_POS)
#define HBN_RTC_TIME_LATCH_L_UMSK                               (~(((1U<<HBN_RTC_TIME_LATCH_L_LEN)-1)<<HBN_RTC_TIME_LATCH_L_POS))

/* 0x10 : RTC_TIME_H */
#define HBN_RTC_TIME_H_OFFSET                                   (0x10)
#define HBN_RTC_TIME_LATCH_H                                    HBN_RTC_TIME_LATCH_H
#define HBN_RTC_TIME_LATCH_H_POS                                (0U)
#define HBN_RTC_TIME_LATCH_H_LEN                                (8U)
#define HBN_RTC_TIME_LATCH_H_MSK                                (((1U<<HBN_RTC_TIME_LATCH_H_LEN)-1)<<HBN_RTC_TIME_LATCH_H_POS)
#define HBN_RTC_TIME_LATCH_H_UMSK                               (~(((1U<<HBN_RTC_TIME_LATCH_H_LEN)-1)<<HBN_RTC_TIME_LATCH_H_POS))
#define HBN_RTC_TIME_LATCH                                      HBN_RTC_TIME_LATCH
#define HBN_RTC_TIME_LATCH_POS                                  (31U)
#define HBN_RTC_TIME_LATCH_LEN                                  (1U)
#define HBN_RTC_TIME_LATCH_MSK                                  (((1U<<HBN_RTC_TIME_LATCH_LEN)-1)<<HBN_RTC_TIME_LATCH_POS)
#define HBN_RTC_TIME_LATCH_UMSK                                 (~(((1U<<HBN_RTC_TIME_LATCH_LEN)-1)<<HBN_RTC_TIME_LATCH_POS))

/* 0x14 : HBN_IRQ_MODE */
#define HBN_IRQ_MODE_OFFSET                                     (0x14)
#define HBN_PIN_WAKEUP_MODE                                     HBN_PIN_WAKEUP_MODE
#define HBN_PIN_WAKEUP_MODE_POS                                 (0U)
#define HBN_PIN_WAKEUP_MODE_LEN                                 (4U)
#define HBN_PIN_WAKEUP_MODE_MSK                                 (((1U<<HBN_PIN_WAKEUP_MODE_LEN)-1)<<HBN_PIN_WAKEUP_MODE_POS)
#define HBN_PIN_WAKEUP_MODE_UMSK                                (~(((1U<<HBN_PIN_WAKEUP_MODE_LEN)-1)<<HBN_PIN_WAKEUP_MODE_POS))
#define HBN_PIN_WAKEUP_MASK                                     HBN_PIN_WAKEUP_MASK
#define HBN_PIN_WAKEUP_MASK_POS                                 (4U)
#define HBN_PIN_WAKEUP_MASK_LEN                                 (10U)
#define HBN_PIN_WAKEUP_MASK_MSK                                 (((1U<<HBN_PIN_WAKEUP_MASK_LEN)-1)<<HBN_PIN_WAKEUP_MASK_POS)
#define HBN_PIN_WAKEUP_MASK_UMSK                                (~(((1U<<HBN_PIN_WAKEUP_MASK_LEN)-1)<<HBN_PIN_WAKEUP_MASK_POS))
#define HBN_PIN_WAKEUP_OPTION                                   HBN_PIN_WAKEUP_OPTION
#define HBN_PIN_WAKEUP_OPTION_POS                               (14U)
#define HBN_PIN_WAKEUP_OPTION_LEN                               (1U)
#define HBN_PIN_WAKEUP_OPTION_MSK                               (((1U<<HBN_PIN_WAKEUP_OPTION_LEN)-1)<<HBN_PIN_WAKEUP_OPTION_POS)
#define HBN_PIN_WAKEUP_OPTION_UMSK                              (~(((1U<<HBN_PIN_WAKEUP_OPTION_LEN)-1)<<HBN_PIN_WAKEUP_OPTION_POS))
#define HBN_REG_EN_HW_PU_PD                                     HBN_REG_EN_HW_PU_PD
#define HBN_REG_EN_HW_PU_PD_POS                                 (16U)
#define HBN_REG_EN_HW_PU_PD_LEN                                 (1U)
#define HBN_REG_EN_HW_PU_PD_MSK                                 (((1U<<HBN_REG_EN_HW_PU_PD_LEN)-1)<<HBN_REG_EN_HW_PU_PD_POS)
#define HBN_REG_EN_HW_PU_PD_UMSK                                (~(((1U<<HBN_REG_EN_HW_PU_PD_LEN)-1)<<HBN_REG_EN_HW_PU_PD_POS))
#define HBN_IRQ_BOD_EN                                          HBN_IRQ_BOD_EN
#define HBN_IRQ_BOD_EN_POS                                      (18U)
#define HBN_IRQ_BOD_EN_LEN                                      (1U)
#define HBN_IRQ_BOD_EN_MSK                                      (((1U<<HBN_IRQ_BOD_EN_LEN)-1)<<HBN_IRQ_BOD_EN_POS)
#define HBN_IRQ_BOD_EN_UMSK                                     (~(((1U<<HBN_IRQ_BOD_EN_LEN)-1)<<HBN_IRQ_BOD_EN_POS))
#define HBN_IRQ_ACOMP0_EN                                       HBN_IRQ_ACOMP0_EN
#define HBN_IRQ_ACOMP0_EN_POS                                   (20U)
#define HBN_IRQ_ACOMP0_EN_LEN                                   (2U)
#define HBN_IRQ_ACOMP0_EN_MSK                                   (((1U<<HBN_IRQ_ACOMP0_EN_LEN)-1)<<HBN_IRQ_ACOMP0_EN_POS)
#define HBN_IRQ_ACOMP0_EN_UMSK                                  (~(((1U<<HBN_IRQ_ACOMP0_EN_LEN)-1)<<HBN_IRQ_ACOMP0_EN_POS))
#define HBN_IRQ_ACOMP1_EN                                       HBN_IRQ_ACOMP1_EN
#define HBN_IRQ_ACOMP1_EN_POS                                   (22U)
#define HBN_IRQ_ACOMP1_EN_LEN                                   (2U)
#define HBN_IRQ_ACOMP1_EN_MSK                                   (((1U<<HBN_IRQ_ACOMP1_EN_LEN)-1)<<HBN_IRQ_ACOMP1_EN_POS)
#define HBN_IRQ_ACOMP1_EN_UMSK                                  (~(((1U<<HBN_IRQ_ACOMP1_EN_LEN)-1)<<HBN_IRQ_ACOMP1_EN_POS))
#define HBN_PIN_WAKEUP_DLY_SEL                                  HBN_PIN_WAKEUP_DLY_SEL
#define HBN_PIN_WAKEUP_DLY_SEL_POS                              (24U)
#define HBN_PIN_WAKEUP_DLY_SEL_LEN                              (3U)
#define HBN_PIN_WAKEUP_DLY_SEL_MSK                              (((1U<<HBN_PIN_WAKEUP_DLY_SEL_LEN)-1)<<HBN_PIN_WAKEUP_DLY_SEL_POS)
#define HBN_PIN_WAKEUP_DLY_SEL_UMSK                             (~(((1U<<HBN_PIN_WAKEUP_DLY_SEL_LEN)-1)<<HBN_PIN_WAKEUP_DLY_SEL_POS))
#define HBN_PIN_WAKEUP_DLY_EN                                   HBN_PIN_WAKEUP_DLY_EN
#define HBN_PIN_WAKEUP_DLY_EN_POS                               (27U)
#define HBN_PIN_WAKEUP_DLY_EN_LEN                               (1U)
#define HBN_PIN_WAKEUP_DLY_EN_MSK                               (((1U<<HBN_PIN_WAKEUP_DLY_EN_LEN)-1)<<HBN_PIN_WAKEUP_DLY_EN_POS)
#define HBN_PIN_WAKEUP_DLY_EN_UMSK                              (~(((1U<<HBN_PIN_WAKEUP_DLY_EN_LEN)-1)<<HBN_PIN_WAKEUP_DLY_EN_POS))
#define HBN_PIN_WAKEUP_DLY_UNIT                                 HBN_PIN_WAKEUP_DLY_UNIT
#define HBN_PIN_WAKEUP_DLY_UNIT_POS                             (28U)
#define HBN_PIN_WAKEUP_DLY_UNIT_LEN                             (2U)
#define HBN_PIN_WAKEUP_DLY_UNIT_MSK                             (((1U<<HBN_PIN_WAKEUP_DLY_UNIT_LEN)-1)<<HBN_PIN_WAKEUP_DLY_UNIT_POS)
#define HBN_PIN_WAKEUP_DLY_UNIT_UMSK                            (~(((1U<<HBN_PIN_WAKEUP_DLY_UNIT_LEN)-1)<<HBN_PIN_WAKEUP_DLY_UNIT_POS))

