bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/hbn_reg.h
/* 0x18 : HBN_IRQ_STAT */
#define HBN_IRQ_STAT_OFFSET                                     (0x18)
#define HBN_IRQ_STAT                                            HBN_IRQ_STAT
#define HBN_IRQ_STAT_POS                                        (0U)
#define HBN_IRQ_STAT_LEN                                        (32U)
#define HBN_IRQ_STAT_MSK                                        (((1U<<HBN_IRQ_STAT_LEN)-1)<<HBN_IRQ_STAT_POS)
#define HBN_IRQ_STAT_UMSK                                       (~(((1U<<HBN_IRQ_STAT_LEN)-1)<<HBN_IRQ_STAT_POS))

/* 0x1C : HBN_IRQ_CLR */
#define HBN_IRQ_CLR_OFFSET                                      (0x1C)
#define HBN_IRQ_CLR                                             HBN_IRQ_CLR
#define HBN_IRQ_CLR_POS                                         (0U)
#define HBN_IRQ_CLR_LEN                                         (32U)
#define HBN_IRQ_CLR_MSK                                         (((1U<<HBN_IRQ_CLR_LEN)-1)<<HBN_IRQ_CLR_POS)
#define HBN_IRQ_CLR_UMSK                                        (~(((1U<<HBN_IRQ_CLR_LEN)-1)<<HBN_IRQ_CLR_POS))

/* 0x20 : HBN_PIR_CFG */
#define HBN_PIR_CFG_OFFSET                                      (0x20)

/* 0x24 : HBN_PIR_VTH */
#define HBN_PIR_VTH_OFFSET                                      (0x24)

/* 0x28 : HBN_PIR_INTERVAL */
#define HBN_PIR_INTERVAL_OFFSET                                 (0x28)

/* 0x2C : HBN_MISC */
#define HBN_MISC_OFFSET                                         (0x2C)
#define HBN_BOD_SEL                                             HBN_BOD_SEL
#define HBN_BOD_SEL_POS                                         (0U)
#define HBN_BOD_SEL_LEN                                         (1U)
#define HBN_BOD_SEL_MSK                                         (((1U<<HBN_BOD_SEL_LEN)-1)<<HBN_BOD_SEL_POS)
#define HBN_BOD_SEL_UMSK                                        (~(((1U<<HBN_BOD_SEL_LEN)-1)<<HBN_BOD_SEL_POS))
#define HBN_BOD_VTH                                             HBN_BOD_VTH
#define HBN_BOD_VTH_POS                                         (1U)
#define HBN_BOD_VTH_LEN                                         (3U)
#define HBN_BOD_VTH_MSK                                         (((1U<<HBN_BOD_VTH_LEN)-1)<<HBN_BOD_VTH_POS)
#define HBN_BOD_VTH_UMSK                                        (~(((1U<<HBN_BOD_VTH_LEN)-1)<<HBN_BOD_VTH_POS))
#define HBN_PU_BOD                                              HBN_PU_BOD
#define HBN_PU_BOD_POS                                          (4U)
#define HBN_PU_BOD_LEN                                          (1U)
#define HBN_PU_BOD_MSK                                          (((1U<<HBN_PU_BOD_LEN)-1)<<HBN_PU_BOD_POS)
#define HBN_PU_BOD_UMSK                                         (~(((1U<<HBN_PU_BOD_LEN)-1)<<HBN_PU_BOD_POS))
#define HBN_R_BOD_OUT                                           HBN_R_BOD_OUT
#define HBN_R_BOD_OUT_POS                                       (5U)
#define HBN_R_BOD_OUT_LEN                                       (1U)
#define HBN_R_BOD_OUT_MSK                                       (((1U<<HBN_R_BOD_OUT_LEN)-1)<<HBN_R_BOD_OUT_POS)
#define HBN_R_BOD_OUT_UMSK                                      (~(((1U<<HBN_R_BOD_OUT_LEN)-1)<<HBN_R_BOD_OUT_POS))
#define HBN_VDD14_BOND_OPTION_ENB_AON                           HBN_VDD14_BOND_OPTION_ENB_AON
#define HBN_VDD14_BOND_OPTION_ENB_AON_POS                       (11U)
#define HBN_VDD14_BOND_OPTION_ENB_AON_LEN                       (1U)
#define HBN_VDD14_BOND_OPTION_ENB_AON_MSK                       (((1U<<HBN_VDD14_BOND_OPTION_ENB_AON_LEN)-1)<<HBN_VDD14_BOND_OPTION_ENB_AON_POS)
#define HBN_VDD14_BOND_OPTION_ENB_AON_UMSK                      (~(((1U<<HBN_VDD14_BOND_OPTION_ENB_AON_LEN)-1)<<HBN_VDD14_BOND_OPTION_ENB_AON_POS))
#define HBN_GPIO_WAKEUP_OUT_AON                                 HBN_GPIO_WAKEUP_OUT_AON
#define HBN_GPIO_WAKEUP_OUT_AON_POS                             (12U)
#define HBN_GPIO_WAKEUP_OUT_AON_LEN                             (3U)
#define HBN_GPIO_WAKEUP_OUT_AON_MSK                             (((1U<<HBN_GPIO_WAKEUP_OUT_AON_LEN)-1)<<HBN_GPIO_WAKEUP_OUT_AON_POS)
#define HBN_GPIO_WAKEUP_OUT_AON_UMSK                            (~(((1U<<HBN_GPIO_WAKEUP_OUT_AON_LEN)-1)<<HBN_GPIO_WAKEUP_OUT_AON_POS))
#define HBN_GPIO_WAKEUP_EN_AON                                  HBN_GPIO_WAKEUP_EN_AON
#define HBN_GPIO_WAKEUP_EN_AON_POS                              (16U)
#define HBN_GPIO_WAKEUP_EN_AON_LEN                              (3U)
#define HBN_GPIO_WAKEUP_EN_AON_MSK                              (((1U<<HBN_GPIO_WAKEUP_EN_AON_LEN)-1)<<HBN_GPIO_WAKEUP_EN_AON_POS)
#define HBN_GPIO_WAKEUP_EN_AON_UMSK                             (~(((1U<<HBN_GPIO_WAKEUP_EN_AON_LEN)-1)<<HBN_GPIO_WAKEUP_EN_AON_POS))
#define HBN_SW_GPIO_LATCH_EN_AON                                HBN_SW_GPIO_LATCH_EN_AON
#define HBN_SW_GPIO_LATCH_EN_AON_POS                            (19U)
#define HBN_SW_GPIO_LATCH_EN_AON_LEN                            (3U)
#define HBN_SW_GPIO_LATCH_EN_AON_MSK                            (((1U<<HBN_SW_GPIO_LATCH_EN_AON_LEN)-1)<<HBN_SW_GPIO_LATCH_EN_AON_POS)
#define HBN_SW_GPIO_LATCH_EN_AON_UMSK                           (~(((1U<<HBN_SW_GPIO_LATCH_EN_AON_LEN)-1)<<HBN_SW_GPIO_LATCH_EN_AON_POS))

/* 0x30 : HBN_GLB */
#define HBN_GLB_OFFSET                                          (0x30)
#define HBN_ROOT_CLK_SEL                                        HBN_ROOT_CLK_SEL
#define HBN_ROOT_CLK_SEL_POS                                    (0U)
#define HBN_ROOT_CLK_SEL_LEN                                    (2U)
#define HBN_ROOT_CLK_SEL_MSK                                    (((1U<<HBN_ROOT_CLK_SEL_LEN)-1)<<HBN_ROOT_CLK_SEL_POS)
#define HBN_ROOT_CLK_SEL_UMSK                                   (~(((1U<<HBN_ROOT_CLK_SEL_LEN)-1)<<HBN_ROOT_CLK_SEL_POS))
#define HBN_UART_CLK_SEL                                        HBN_UART_CLK_SEL
#define HBN_UART_CLK_SEL_POS                                    (2U)
#define HBN_UART_CLK_SEL_LEN                                    (1U)
#define HBN_UART_CLK_SEL_MSK                                    (((1U<<HBN_UART_CLK_SEL_LEN)-1)<<HBN_UART_CLK_SEL_POS)
#define HBN_UART_CLK_SEL_UMSK                                   (~(((1U<<HBN_UART_CLK_SEL_LEN)-1)<<HBN_UART_CLK_SEL_POS))
#define HBN_F32K_SEL                                            HBN_F32K_SEL
#define HBN_F32K_SEL_POS                                        (3U)
#define HBN_F32K_SEL_LEN                                        (2U)
#define HBN_F32K_SEL_MSK                                        (((1U<<HBN_F32K_SEL_LEN)-1)<<HBN_F32K_SEL_POS)
#define HBN_F32K_SEL_UMSK                                       (~(((1U<<HBN_F32K_SEL_LEN)-1)<<HBN_F32K_SEL_POS))
#define HBN_PU_RC32K                                            HBN_PU_RC32K
#define HBN_PU_RC32K_POS                                        (5U)
#define HBN_PU_RC32K_LEN                                        (1U)
#define HBN_PU_RC32K_MSK                                        (((1U<<HBN_PU_RC32K_LEN)-1)<<HBN_PU_RC32K_POS)
#define HBN_PU_RC32K_UMSK                                       (~(((1U<<HBN_PU_RC32K_LEN)-1)<<HBN_PU_RC32K_POS))
#define HBN_RESET_EVENT                                         HBN_RESET_EVENT
#define HBN_RESET_EVENT_POS                                     (6U)
#define HBN_RESET_EVENT_LEN                                     (7U)
#define HBN_RESET_EVENT_MSK                                     (((1U<<HBN_RESET_EVENT_LEN)-1)<<HBN_RESET_EVENT_POS)
#define HBN_RESET_EVENT_UMSK                                    (~(((1U<<HBN_RESET_EVENT_LEN)-1)<<HBN_RESET_EVENT_POS))
#define HBN_CLEAR_RESET_EVENT                                   HBN_CLEAR_RESET_EVENT
#define HBN_CLEAR_RESET_EVENT_POS                               (13U)
#define HBN_CLEAR_RESET_EVENT_LEN                               (1U)
#define HBN_CLEAR_RESET_EVENT_MSK                               (((1U<<HBN_CLEAR_RESET_EVENT_LEN)-1)<<HBN_CLEAR_RESET_EVENT_POS)
#define HBN_CLEAR_RESET_EVENT_UMSK                              (~(((1U<<HBN_CLEAR_RESET_EVENT_LEN)-1)<<HBN_CLEAR_RESET_EVENT_POS))
#define HBN_EN_HBN_WATCHDOG_TIMEOUT                             HBN_EN_HBN_WATCHDOG_TIMEOUT
#define HBN_EN_HBN_WATCHDOG_TIMEOUT_POS                         (14U)
#define HBN_EN_HBN_WATCHDOG_TIMEOUT_LEN                         (1U)
#define HBN_EN_HBN_WATCHDOG_TIMEOUT_MSK                         (((1U<<HBN_EN_HBN_WATCHDOG_TIMEOUT_LEN)-1)<<HBN_EN_HBN_WATCHDOG_TIMEOUT_POS)
#define HBN_EN_HBN_WATCHDOG_TIMEOUT_UMSK                        (~(((1U<<HBN_EN_HBN_WATCHDOG_TIMEOUT_LEN)-1)<<HBN_EN_HBN_WATCHDOG_TIMEOUT_POS))
#define HBN_UART_CLK_SEL2                                       HBN_UART_CLK_SEL2
#define HBN_UART_CLK_SEL2_POS                                   (15U)
#define HBN_UART_CLK_SEL2_LEN                                   (1U)
#define HBN_UART_CLK_SEL2_MSK                                   (((1U<<HBN_UART_CLK_SEL2_LEN)-1)<<HBN_UART_CLK_SEL2_POS)
#define HBN_UART_CLK_SEL2_UMSK                                  (~(((1U<<HBN_UART_CLK_SEL2_LEN)-1)<<HBN_UART_CLK_SEL2_POS))
#define HBN_SW_LDO11SOC_VOUT_SEL_AON                            HBN_SW_LDO11SOC_VOUT_SEL_AON
#define HBN_SW_LDO11SOC_VOUT_SEL_AON_POS                        (16U)
#define HBN_SW_LDO11SOC_VOUT_SEL_AON_LEN                        (4U)
#define HBN_SW_LDO11SOC_VOUT_SEL_AON_MSK                        (((1U<<HBN_SW_LDO11SOC_VOUT_SEL_AON_LEN)-1)<<HBN_SW_LDO11SOC_VOUT_SEL_AON_POS)
#define HBN_SW_LDO11SOC_VOUT_SEL_AON_UMSK                       (~(((1U<<HBN_SW_LDO11SOC_VOUT_SEL_AON_LEN)-1)<<HBN_SW_LDO11SOC_VOUT_SEL_AON_POS))
#define HBN_SW_LDO11_RT_SLAVE_EN_AON                            HBN_SW_LDO11_RT_SLAVE_EN_AON
#define HBN_SW_LDO11_RT_SLAVE_EN_AON_POS                        (20U)
#define HBN_SW_LDO11_RT_SLAVE_EN_AON_LEN                        (1U)
#define HBN_SW_LDO11_RT_SLAVE_EN_AON_MSK                        (((1U<<HBN_SW_LDO11_RT_SLAVE_EN_AON_LEN)-1)<<HBN_SW_LDO11_RT_SLAVE_EN_AON_POS)
#define HBN_SW_LDO11_RT_SLAVE_EN_AON_UMSK                       (~(((1U<<HBN_SW_LDO11_RT_SLAVE_EN_AON_LEN)-1)<<HBN_SW_LDO11_RT_SLAVE_EN_AON_POS))
#define HBN_SW_LDO11_RT_DIRECT_CONN_EN_AON                      HBN_SW_LDO11_RT_DIRECT_CONN_EN_AON
#define HBN_SW_LDO11_RT_DIRECT_CONN_EN_AON_POS                  (21U)
#define HBN_SW_LDO11_RT_DIRECT_CONN_EN_AON_LEN                  (1U)
#define HBN_SW_LDO11_RT_DIRECT_CONN_EN_AON_MSK                  (((1U<<HBN_SW_LDO11_RT_DIRECT_CONN_EN_AON_LEN)-1)<<HBN_SW_LDO11_RT_DIRECT_CONN_EN_AON_POS)
#define HBN_SW_LDO11_RT_DIRECT_CONN_EN_AON_UMSK                 (~(((1U<<HBN_SW_LDO11_RT_DIRECT_CONN_EN_AON_LEN)-1)<<HBN_SW_LDO11_RT_DIRECT_CONN_EN_AON_POS))
#define HBN_EN_HBN_WDT_RESET_AS_SWRST                           HBN_EN_HBN_WDT_RESET_AS_SWRST
#define HBN_EN_HBN_WDT_RESET_AS_SWRST_POS                       (22U)
#define HBN_EN_HBN_WDT_RESET_AS_SWRST_LEN                       (1U)
#define HBN_EN_HBN_WDT_RESET_AS_SWRST_MSK                       (((1U<<HBN_EN_HBN_WDT_RESET_AS_SWRST_LEN)-1)<<HBN_EN_HBN_WDT_RESET_AS_SWRST_POS)
#define HBN_EN_HBN_WDT_RESET_AS_SWRST_UMSK                      (~(((1U<<HBN_EN_HBN_WDT_RESET_AS_SWRST_LEN)-1)<<HBN_EN_HBN_WDT_RESET_AS_SWRST_POS))
#define HBN_SW_LDO11_ILD_SEL_AON                                HBN_SW_LDO11_ILD_SEL_AON
#define HBN_SW_LDO11_ILD_SEL_AON_POS                            (24U)
#define HBN_SW_LDO11_ILD_SEL_AON_LEN                            (4U)
#define HBN_SW_LDO11_ILD_SEL_AON_MSK                            (((1U<<HBN_SW_LDO11_ILD_SEL_AON_LEN)-1)<<HBN_SW_LDO11_ILD_SEL_AON_POS)
#define HBN_SW_LDO11_ILD_SEL_AON_UMSK                           (~(((1U<<HBN_SW_LDO11_ILD_SEL_AON_LEN)-1)<<HBN_SW_LDO11_ILD_SEL_AON_POS))
#define HBN_SW_LDO11_AON_VOUT_SEL                               HBN_SW_LDO11_AON_VOUT_SEL
#define HBN_SW_LDO11_AON_VOUT_SEL_POS                           (28U)
#define HBN_SW_LDO11_AON_VOUT_SEL_LEN                           (4U)
#define HBN_SW_LDO11_AON_VOUT_SEL_MSK                           (((1U<<HBN_SW_LDO11_AON_VOUT_SEL_LEN)-1)<<HBN_SW_LDO11_AON_VOUT_SEL_POS)
#define HBN_SW_LDO11_AON_VOUT_SEL_UMSK                          (~(((1U<<HBN_SW_LDO11_AON_VOUT_SEL_LEN)-1)<<HBN_SW_LDO11_AON_VOUT_SEL_POS))

/* 0x34 : HBN_SRAM */
#define HBN_SRAM_OFFSET                                         (0x34)
#define HBN_RETRAM_EMA                                          HBN_RETRAM_EMA
#define HBN_RETRAM_EMA_POS                                      (0U)
#define HBN_RETRAM_EMA_LEN                                      (3U)
#define HBN_RETRAM_EMA_MSK                                      (((1U<<HBN_RETRAM_EMA_LEN)-1)<<HBN_RETRAM_EMA_POS)
#define HBN_RETRAM_EMA_UMSK                                     (~(((1U<<HBN_RETRAM_EMA_LEN)-1)<<HBN_RETRAM_EMA_POS))
#define HBN_RETRAM_EMAW                                         HBN_RETRAM_EMAW
#define HBN_RETRAM_EMAW_POS                                     (3U)
#define HBN_RETRAM_EMAW_LEN                                     (2U)
#define HBN_RETRAM_EMAW_MSK                                     (((1U<<HBN_RETRAM_EMAW_LEN)-1)<<HBN_RETRAM_EMAW_POS)
#define HBN_RETRAM_EMAW_UMSK                                    (~(((1U<<HBN_RETRAM_EMAW_LEN)-1)<<HBN_RETRAM_EMAW_POS))
#define HBN_RETRAM_RET                                          HBN_RETRAM_RET
#define HBN_RETRAM_RET_POS                                      (6U)
#define HBN_RETRAM_RET_LEN                                      (1U)
#define HBN_RETRAM_RET_MSK                                      (((1U<<HBN_RETRAM_RET_LEN)-1)<<HBN_RETRAM_RET_POS)
#define HBN_RETRAM_RET_UMSK                                     (~(((1U<<HBN_RETRAM_RET_LEN)-1)<<HBN_RETRAM_RET_POS))
#define HBN_RETRAM_SLP                                          HBN_RETRAM_SLP
#define HBN_RETRAM_SLP_POS                                      (7U)
#define HBN_RETRAM_SLP_LEN                                      (1U)
#define HBN_RETRAM_SLP_MSK                                      (((1U<<HBN_RETRAM_SLP_LEN)-1)<<HBN_RETRAM_SLP_POS)
#define HBN_RETRAM_SLP_UMSK                                     (~(((1U<<HBN_RETRAM_SLP_LEN)-1)<<HBN_RETRAM_SLP_POS))

