bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/hbn_reg.h
/* 0x38 : HBN_PAD_CTRL_0 */
#define HBN_PAD_CTRL_0_OFFSET                                   (0x38)
#define HBN_REG_AON_GPIO_IE_SMT                                 HBN_REG_AON_GPIO_IE_SMT
#define HBN_REG_AON_GPIO_IE_SMT_POS                             (0U)
#define HBN_REG_AON_GPIO_IE_SMT_LEN                             (7U)
#define HBN_REG_AON_GPIO_IE_SMT_MSK                             (((1U<<HBN_REG_AON_GPIO_IE_SMT_LEN)-1)<<HBN_REG_AON_GPIO_IE_SMT_POS)
#define HBN_REG_AON_GPIO_IE_SMT_UMSK                            (~(((1U<<HBN_REG_AON_GPIO_IE_SMT_LEN)-1)<<HBN_REG_AON_GPIO_IE_SMT_POS))
#define HBN_REG_AON_GPIO_DRV                                    HBN_REG_AON_GPIO_DRV
#define HBN_REG_AON_GPIO_DRV_POS                                (8U)
#define HBN_REG_AON_GPIO_DRV_LEN                                (2U)
#define HBN_REG_AON_GPIO_DRV_MSK                                (((1U<<HBN_REG_AON_GPIO_DRV_LEN)-1)<<HBN_REG_AON_GPIO_DRV_POS)
#define HBN_REG_AON_GPIO_DRV_UMSK                               (~(((1U<<HBN_REG_AON_GPIO_DRV_LEN)-1)<<HBN_REG_AON_GPIO_DRV_POS))
#define HBN_REG_AON_LED_SEL                                     HBN_REG_AON_LED_SEL
#define HBN_REG_AON_LED_SEL_POS                                 (10U)
#define HBN_REG_AON_LED_SEL_LEN                                 (9U)
#define HBN_REG_AON_LED_SEL_MSK                                 (((1U<<HBN_REG_AON_LED_SEL_LEN)-1)<<HBN_REG_AON_LED_SEL_POS)
#define HBN_REG_AON_LED_SEL_UMSK                                (~(((1U<<HBN_REG_AON_LED_SEL_LEN)-1)<<HBN_REG_AON_LED_SEL_POS))
#define HBN_REG_EN_AON_CTRL_GPIO                                HBN_REG_EN_AON_CTRL_GPIO
#define HBN_REG_EN_AON_CTRL_GPIO_POS                            (20U)
#define HBN_REG_EN_AON_CTRL_GPIO_LEN                            (7U)
#define HBN_REG_EN_AON_CTRL_GPIO_MSK                            (((1U<<HBN_REG_EN_AON_CTRL_GPIO_LEN)-1)<<HBN_REG_EN_AON_CTRL_GPIO_POS)
#define HBN_REG_EN_AON_CTRL_GPIO_UMSK                           (~(((1U<<HBN_REG_EN_AON_CTRL_GPIO_LEN)-1)<<HBN_REG_EN_AON_CTRL_GPIO_POS))
#define HBN_CR_GPIO_KEEP_EN                                     HBN_CR_GPIO_KEEP_EN
#define HBN_CR_GPIO_KEEP_EN_POS                                 (28U)
#define HBN_CR_GPIO_KEEP_EN_LEN                                 (3U)
#define HBN_CR_GPIO_KEEP_EN_MSK                                 (((1U<<HBN_CR_GPIO_KEEP_EN_LEN)-1)<<HBN_CR_GPIO_KEEP_EN_POS)
#define HBN_CR_GPIO_KEEP_EN_UMSK                                (~(((1U<<HBN_CR_GPIO_KEEP_EN_LEN)-1)<<HBN_CR_GPIO_KEEP_EN_POS))
#define HBN_REG_AON_GPIO_ISO_MODE                               HBN_REG_AON_GPIO_ISO_MODE
#define HBN_REG_AON_GPIO_ISO_MODE_POS                           (31U)
#define HBN_REG_AON_GPIO_ISO_MODE_LEN                           (1U)
#define HBN_REG_AON_GPIO_ISO_MODE_MSK                           (((1U<<HBN_REG_AON_GPIO_ISO_MODE_LEN)-1)<<HBN_REG_AON_GPIO_ISO_MODE_POS)
#define HBN_REG_AON_GPIO_ISO_MODE_UMSK                          (~(((1U<<HBN_REG_AON_GPIO_ISO_MODE_LEN)-1)<<HBN_REG_AON_GPIO_ISO_MODE_POS))

/* 0x3C : HBN_PAD_CTRL_1 */
#define HBN_PAD_CTRL_1_OFFSET                                   (0x3C)
#define HBN_REG_AON_GPIO_OE                                     HBN_REG_AON_GPIO_OE
#define HBN_REG_AON_GPIO_OE_POS                                 (0U)
#define HBN_REG_AON_GPIO_OE_LEN                                 (7U)
#define HBN_REG_AON_GPIO_OE_MSK                                 (((1U<<HBN_REG_AON_GPIO_OE_LEN)-1)<<HBN_REG_AON_GPIO_OE_POS)
#define HBN_REG_AON_GPIO_OE_UMSK                                (~(((1U<<HBN_REG_AON_GPIO_OE_LEN)-1)<<HBN_REG_AON_GPIO_OE_POS))
#define HBN_REG_AON_GPIO_PD                                     HBN_REG_AON_GPIO_PD
#define HBN_REG_AON_GPIO_PD_POS                                 (8U)
#define HBN_REG_AON_GPIO_PD_LEN                                 (7U)
#define HBN_REG_AON_GPIO_PD_MSK                                 (((1U<<HBN_REG_AON_GPIO_PD_LEN)-1)<<HBN_REG_AON_GPIO_PD_POS)
#define HBN_REG_AON_GPIO_PD_UMSK                                (~(((1U<<HBN_REG_AON_GPIO_PD_LEN)-1)<<HBN_REG_AON_GPIO_PD_POS))
#define HBN_REG_AON_GPIO_PU                                     HBN_REG_AON_GPIO_PU
#define HBN_REG_AON_GPIO_PU_POS                                 (16U)
#define HBN_REG_AON_GPIO_PU_LEN                                 (7U)
#define HBN_REG_AON_GPIO_PU_MSK                                 (((1U<<HBN_REG_AON_GPIO_PU_LEN)-1)<<HBN_REG_AON_GPIO_PU_POS)
#define HBN_REG_AON_GPIO_PU_UMSK                                (~(((1U<<HBN_REG_AON_GPIO_PU_LEN)-1)<<HBN_REG_AON_GPIO_PU_POS))
#define HBN_REG_AON_GPIO_O                                      HBN_REG_AON_GPIO_O
#define HBN_REG_AON_GPIO_O_POS                                  (24U)
#define HBN_REG_AON_GPIO_O_LEN                                  (7U)
#define HBN_REG_AON_GPIO_O_MSK                                  (((1U<<HBN_REG_AON_GPIO_O_LEN)-1)<<HBN_REG_AON_GPIO_O_POS)
#define HBN_REG_AON_GPIO_O_UMSK                                 (~(((1U<<HBN_REG_AON_GPIO_O_LEN)-1)<<HBN_REG_AON_GPIO_O_POS))
#define HBN_REG_SEL_AON_GPIO_O                                  HBN_REG_SEL_AON_GPIO_O
#define HBN_REG_SEL_AON_GPIO_O_POS                              (31U)
#define HBN_REG_SEL_AON_GPIO_O_LEN                              (1U)
#define HBN_REG_SEL_AON_GPIO_O_MSK                              (((1U<<HBN_REG_SEL_AON_GPIO_O_LEN)-1)<<HBN_REG_SEL_AON_GPIO_O_POS)
#define HBN_REG_SEL_AON_GPIO_O_UMSK                             (~(((1U<<HBN_REG_SEL_AON_GPIO_O_LEN)-1)<<HBN_REG_SEL_AON_GPIO_O_POS))

/* 0x100 : HBN_RSV0 */
#define HBN_RSV0_OFFSET                                         (0x100)
#define HBN_RSV0                                                HBN_RSV0
#define HBN_RSV0_POS                                            (0U)
#define HBN_RSV0_LEN                                            (32U)
#define HBN_RSV0_MSK                                            (((1U<<HBN_RSV0_LEN)-1)<<HBN_RSV0_POS)
#define HBN_RSV0_UMSK                                           (~(((1U<<HBN_RSV0_LEN)-1)<<HBN_RSV0_POS))

