bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/hbn_reg.h
/* 0x104 : HBN_RSV1 */
#define HBN_RSV1_OFFSET                                         (0x104)
#define HBN_RSV1                                                HBN_RSV1
#define HBN_RSV1_POS                                            (0U)
#define HBN_RSV1_LEN                                            (32U)
#define HBN_RSV1_MSK                                            (((1U<<HBN_RSV1_LEN)-1)<<HBN_RSV1_POS)
#define HBN_RSV1_UMSK                                           (~(((1U<<HBN_RSV1_LEN)-1)<<HBN_RSV1_POS))

/* 0x108 : HBN_RSV2 */
#define HBN_RSV2_OFFSET                                         (0x108)
#define HBN_RSV2                                                HBN_RSV2
#define HBN_RSV2_POS                                            (0U)
#define HBN_RSV2_LEN                                            (32U)
#define HBN_RSV2_MSK                                            (((1U<<HBN_RSV2_LEN)-1)<<HBN_RSV2_POS)
#define HBN_RSV2_UMSK                                           (~(((1U<<HBN_RSV2_LEN)-1)<<HBN_RSV2_POS))

/* 0x10C : HBN_RSV3 */
#define HBN_RSV3_OFFSET                                         (0x10C)
#define HBN_RSV3                                                HBN_RSV3
#define HBN_RSV3_POS                                            (0U)
#define HBN_RSV3_LEN                                            (32U)
#define HBN_RSV3_MSK                                            (((1U<<HBN_RSV3_LEN)-1)<<HBN_RSV3_POS)
#define HBN_RSV3_UMSK                                           (~(((1U<<HBN_RSV3_LEN)-1)<<HBN_RSV3_POS))

/* 0x200 : rc32k_ctrl0 */
#define HBN_RC32K_CTRL0_OFFSET                                  (0x200)
#define HBN_RC32K_RDY                                           HBN_RC32K_RDY
#define HBN_RC32K_RDY_POS                                       (1U)
#define HBN_RC32K_RDY_LEN                                       (1U)
#define HBN_RC32K_RDY_MSK                                       (((1U<<HBN_RC32K_RDY_LEN)-1)<<HBN_RC32K_RDY_POS)
#define HBN_RC32K_RDY_UMSK                                      (~(((1U<<HBN_RC32K_RDY_LEN)-1)<<HBN_RC32K_RDY_POS))
#define HBN_RC32K_CAL_EN                                        HBN_RC32K_CAL_EN
#define HBN_RC32K_CAL_EN_POS                                    (20U)
#define HBN_RC32K_CAL_EN_LEN                                    (1U)
#define HBN_RC32K_CAL_EN_MSK                                    (((1U<<HBN_RC32K_CAL_EN_LEN)-1)<<HBN_RC32K_CAL_EN_POS)
#define HBN_RC32K_CAL_EN_UMSK                                   (~(((1U<<HBN_RC32K_CAL_EN_LEN)-1)<<HBN_RC32K_CAL_EN_POS))
#define HBN_RC32K_CAP_SEL                                       HBN_RC32K_CAP_SEL
#define HBN_RC32K_CAP_SEL_POS                                   (28U)
#define HBN_RC32K_CAP_SEL_LEN                                   (4U)
#define HBN_RC32K_CAP_SEL_MSK                                   (((1U<<HBN_RC32K_CAP_SEL_LEN)-1)<<HBN_RC32K_CAP_SEL_POS)
#define HBN_RC32K_CAP_SEL_UMSK                                  (~(((1U<<HBN_RC32K_CAP_SEL_LEN)-1)<<HBN_RC32K_CAP_SEL_POS))

/* 0x204 : xtal32k */
#define HBN_XTAL32K_OFFSET                                      (0x204)
#define HBN_XTAL32K_HIZ_EN                                      HBN_XTAL32K_HIZ_EN
#define HBN_XTAL32K_HIZ_EN_POS                                  (0U)
#define HBN_XTAL32K_HIZ_EN_LEN                                  (1U)
#define HBN_XTAL32K_HIZ_EN_MSK                                  (((1U<<HBN_XTAL32K_HIZ_EN_LEN)-1)<<HBN_XTAL32K_HIZ_EN_POS)
#define HBN_XTAL32K_HIZ_EN_UMSK                                 (~(((1U<<HBN_XTAL32K_HIZ_EN_LEN)-1)<<HBN_XTAL32K_HIZ_EN_POS))
#define HBN_XTAL32K_LOWV_EN                                     HBN_XTAL32K_LOWV_EN
#define HBN_XTAL32K_LOWV_EN_POS                                 (1U)
#define HBN_XTAL32K_LOWV_EN_LEN                                 (1U)
#define HBN_XTAL32K_LOWV_EN_MSK                                 (((1U<<HBN_XTAL32K_LOWV_EN_LEN)-1)<<HBN_XTAL32K_LOWV_EN_POS)
#define HBN_XTAL32K_LOWV_EN_UMSK                                (~(((1U<<HBN_XTAL32K_LOWV_EN_LEN)-1)<<HBN_XTAL32K_LOWV_EN_POS))
#define HBN_XTAL32K_EXT_SEL                                     HBN_XTAL32K_EXT_SEL
#define HBN_XTAL32K_EXT_SEL_POS                                 (2U)
#define HBN_XTAL32K_EXT_SEL_LEN                                 (1U)
#define HBN_XTAL32K_EXT_SEL_MSK                                 (((1U<<HBN_XTAL32K_EXT_SEL_LEN)-1)<<HBN_XTAL32K_EXT_SEL_POS)
#define HBN_XTAL32K_EXT_SEL_UMSK                                (~(((1U<<HBN_XTAL32K_EXT_SEL_LEN)-1)<<HBN_XTAL32K_EXT_SEL_POS))
#define HBN_XTAL32K_AMP_CTRL                                    HBN_XTAL32K_AMP_CTRL
#define HBN_XTAL32K_AMP_CTRL_POS                                (3U)
#define HBN_XTAL32K_AMP_CTRL_LEN                                (2U)
#define HBN_XTAL32K_AMP_CTRL_MSK                                (((1U<<HBN_XTAL32K_AMP_CTRL_LEN)-1)<<HBN_XTAL32K_AMP_CTRL_POS)
#define HBN_XTAL32K_AMP_CTRL_UMSK                               (~(((1U<<HBN_XTAL32K_AMP_CTRL_LEN)-1)<<HBN_XTAL32K_AMP_CTRL_POS))
#define HBN_XTAL32K_REG                                         HBN_XTAL32K_REG
#define HBN_XTAL32K_REG_POS                                     (5U)
#define HBN_XTAL32K_REG_LEN                                     (2U)
#define HBN_XTAL32K_REG_MSK                                     (((1U<<HBN_XTAL32K_REG_LEN)-1)<<HBN_XTAL32K_REG_POS)
#define HBN_XTAL32K_REG_UMSK                                    (~(((1U<<HBN_XTAL32K_REG_LEN)-1)<<HBN_XTAL32K_REG_POS))
#define HBN_XTAL32K_OUTBUF_STRE                                 HBN_XTAL32K_OUTBUF_STRE
#define HBN_XTAL32K_OUTBUF_STRE_POS                             (7U)
#define HBN_XTAL32K_OUTBUF_STRE_LEN                             (1U)
#define HBN_XTAL32K_OUTBUF_STRE_MSK                             (((1U<<HBN_XTAL32K_OUTBUF_STRE_LEN)-1)<<HBN_XTAL32K_OUTBUF_STRE_POS)
#define HBN_XTAL32K_OUTBUF_STRE_UMSK                            (~(((1U<<HBN_XTAL32K_OUTBUF_STRE_LEN)-1)<<HBN_XTAL32K_OUTBUF_STRE_POS))
#define HBN_XTAL32K_OTF_SHORT                                   HBN_XTAL32K_OTF_SHORT
#define HBN_XTAL32K_OTF_SHORT_POS                               (8U)
#define HBN_XTAL32K_OTF_SHORT_LEN                               (1U)
#define HBN_XTAL32K_OTF_SHORT_MSK                               (((1U<<HBN_XTAL32K_OTF_SHORT_LEN)-1)<<HBN_XTAL32K_OTF_SHORT_POS)
#define HBN_XTAL32K_OTF_SHORT_UMSK                              (~(((1U<<HBN_XTAL32K_OTF_SHORT_LEN)-1)<<HBN_XTAL32K_OTF_SHORT_POS))
#define HBN_XTAL32K_INV_STRE                                    HBN_XTAL32K_INV_STRE
#define HBN_XTAL32K_INV_STRE_POS                                (9U)
#define HBN_XTAL32K_INV_STRE_LEN                                (2U)
#define HBN_XTAL32K_INV_STRE_MSK                                (((1U<<HBN_XTAL32K_INV_STRE_LEN)-1)<<HBN_XTAL32K_INV_STRE_POS)
#define HBN_XTAL32K_INV_STRE_UMSK                               (~(((1U<<HBN_XTAL32K_INV_STRE_LEN)-1)<<HBN_XTAL32K_INV_STRE_POS))
#define HBN_XTAL32K_CAPBANK                                     HBN_XTAL32K_CAPBANK
#define HBN_XTAL32K_CAPBANK_POS                                 (11U)
#define HBN_XTAL32K_CAPBANK_LEN                                 (6U)
#define HBN_XTAL32K_CAPBANK_MSK                                 (((1U<<HBN_XTAL32K_CAPBANK_LEN)-1)<<HBN_XTAL32K_CAPBANK_POS)
#define HBN_XTAL32K_CAPBANK_UMSK                                (~(((1U<<HBN_XTAL32K_CAPBANK_LEN)-1)<<HBN_XTAL32K_CAPBANK_POS))
#define HBN_XTAL32K_AC_CAP_SHORT                                HBN_XTAL32K_AC_CAP_SHORT
#define HBN_XTAL32K_AC_CAP_SHORT_POS                            (17U)
#define HBN_XTAL32K_AC_CAP_SHORT_LEN                            (1U)
#define HBN_XTAL32K_AC_CAP_SHORT_MSK                            (((1U<<HBN_XTAL32K_AC_CAP_SHORT_LEN)-1)<<HBN_XTAL32K_AC_CAP_SHORT_POS)
#define HBN_XTAL32K_AC_CAP_SHORT_UMSK                           (~(((1U<<HBN_XTAL32K_AC_CAP_SHORT_LEN)-1)<<HBN_XTAL32K_AC_CAP_SHORT_POS))
#define HBN_PU_XTAL32K_BUF                                      HBN_PU_XTAL32K_BUF
#define HBN_PU_XTAL32K_BUF_POS                                  (18U)
#define HBN_PU_XTAL32K_BUF_LEN                                  (1U)
#define HBN_PU_XTAL32K_BUF_MSK                                  (((1U<<HBN_PU_XTAL32K_BUF_LEN)-1)<<HBN_PU_XTAL32K_BUF_POS)
#define HBN_PU_XTAL32K_BUF_UMSK                                 (~(((1U<<HBN_PU_XTAL32K_BUF_LEN)-1)<<HBN_PU_XTAL32K_BUF_POS))
#define HBN_PU_XTAL32K                                          HBN_PU_XTAL32K
#define HBN_PU_XTAL32K_POS                                      (19U)
#define HBN_PU_XTAL32K_LEN                                      (1U)
#define HBN_PU_XTAL32K_MSK                                      (((1U<<HBN_PU_XTAL32K_LEN)-1)<<HBN_PU_XTAL32K_POS)
#define HBN_PU_XTAL32K_UMSK                                     (~(((1U<<HBN_PU_XTAL32K_LEN)-1)<<HBN_PU_XTAL32K_POS))

/* 0x208 : rc32k_ctrl1 */
#define HBN_RC32K_CTRL1_OFFSET                                  (0x208)
#define HBN_RC32K_CODE_FR_CAL                                   HBN_RC32K_CODE_FR_CAL
#define HBN_RC32K_CODE_FR_CAL_POS                               (0U)
#define HBN_RC32K_CODE_FR_CAL_LEN                               (13U)
#define HBN_RC32K_CODE_FR_CAL_MSK                               (((1U<<HBN_RC32K_CODE_FR_CAL_LEN)-1)<<HBN_RC32K_CODE_FR_CAL_POS)
#define HBN_RC32K_CODE_FR_CAL_UMSK                              (~(((1U<<HBN_RC32K_CODE_FR_CAL_LEN)-1)<<HBN_RC32K_CODE_FR_CAL_POS))
#define HBN_RC32K_SDM_RSTB                                      HBN_RC32K_SDM_RSTB
#define HBN_RC32K_SDM_RSTB_POS                                  (16U)
#define HBN_RC32K_SDM_RSTB_LEN                                  (1U)
#define HBN_RC32K_SDM_RSTB_MSK                                  (((1U<<HBN_RC32K_SDM_RSTB_LEN)-1)<<HBN_RC32K_SDM_RSTB_POS)
#define HBN_RC32K_SDM_RSTB_UMSK                                 (~(((1U<<HBN_RC32K_SDM_RSTB_LEN)-1)<<HBN_RC32K_SDM_RSTB_POS))
#define HBN_RC32K_SDM_BYPASS                                    HBN_RC32K_SDM_BYPASS
#define HBN_RC32K_SDM_BYPASS_POS                                (20U)
#define HBN_RC32K_SDM_BYPASS_LEN                                (1U)
#define HBN_RC32K_SDM_BYPASS_MSK                                (((1U<<HBN_RC32K_SDM_BYPASS_LEN)-1)<<HBN_RC32K_SDM_BYPASS_POS)
#define HBN_RC32K_SDM_BYPASS_UMSK                               (~(((1U<<HBN_RC32K_SDM_BYPASS_LEN)-1)<<HBN_RC32K_SDM_BYPASS_POS))
#define HBN_AON_RC32K_RESV                                      HBN_AON_RC32K_RESV
#define HBN_AON_RC32K_RESV_POS                                  (28U)
#define HBN_AON_RC32K_RESV_LEN                                  (4U)
#define HBN_AON_RC32K_RESV_MSK                                  (((1U<<HBN_AON_RC32K_RESV_LEN)-1)<<HBN_AON_RC32K_RESV_POS)
#define HBN_AON_RC32K_RESV_UMSK                                 (~(((1U<<HBN_AON_RC32K_RESV_LEN)-1)<<HBN_AON_RC32K_RESV_POS))


