bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/hbn_reg.h
struct  hbn_reg {
    /* 0x0 : HBN_CTL */
    union {
        struct {
            uint32_t rtc_ctl                        :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t reserved_4_6                   :  3; /* [ 6: 4],       rsvd,        0x0 */
            uint32_t hbn_mode                       :  1; /* [    7],          w,        0x0 */
            uint32_t trap_mode                      :  1; /* [    8],          r,        0x0 */
            uint32_t pwrdn_hbn_core                 :  1; /* [    9],        r/w,        0x0 */
            uint32_t reserved_10                    :  1; /* [   10],       rsvd,        0x0 */
            uint32_t pwrdn_hbn_rtc                  :  1; /* [   11],        r/w,        0x0 */
            uint32_t sw_rst                         :  1; /* [   12],        r/w,        0x0 */
            uint32_t hbn_dis_pwr_off_ldo11          :  1; /* [   13],        r/w,        0x0 */
            uint32_t hbn_dis_pwr_off_ldo11_rt       :  1; /* [   14],        r/w,        0x0 */
            uint32_t pu_ldo14_aon                   :  1; /* [   15],        r/w,        0x1 */
            uint32_t sw_force_ldo14_off             :  1; /* [   16],        r/w,        0x0 */
            uint32_t sw_force_dcdc_off              :  1; /* [   17],        r/w,        0x0 */
            uint32_t reserved_18                    :  1; /* [   18],       rsvd,        0x0 */
            uint32_t hbn_ldo11_aon_vout_sel         :  4; /* [22:19],        r/w,        0xa */
            uint32_t pu_dcdc_aon                    :  1; /* [   23],        r/w,        0x1 */
            uint32_t rtc_dly_option                 :  1; /* [   24],        r/w,        0x0 */
            uint32_t pwr_on_option                  :  1; /* [   25],        r/w,        0x0 */
            uint32_t sram_slp_option                :  1; /* [   26],        r/w,        0x0 */
            uint32_t sram_slp                       :  1; /* [   27],          r,        0x0 */
            uint32_t hbn_state                      :  4; /* [31:28],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_CTL;

    /* 0x4 : HBN_TIME_L */
    union {
        struct {
            uint32_t hbn_time_l                     : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_TIME_L;

    /* 0x8 : HBN_TIME_H */
    union {
        struct {
            uint32_t hbn_time_h                     :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31                  : 24; /* [31: 8],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_TIME_H;

    /* 0xC : RTC_TIME_L */
    union {
        struct {
            uint32_t rtc_time_latch_l               : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } RTC_TIME_L;

    /* 0x10 : RTC_TIME_H */
    union {
        struct {
            uint32_t rtc_time_latch_h               :  8; /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_30                  : 23; /* [30: 8],       rsvd,        0x0 */
            uint32_t rtc_time_latch                 :  1; /* [   31],          w,        0x0 */
        }BF;
        uint32_t WORD;
    } RTC_TIME_H;

    /* 0x14 : HBN_IRQ_MODE */
    union {
        struct {
            uint32_t hbn_pin_wakeup_mode            :  4; /* [ 3: 0],        r/w,        0x5 */
            uint32_t hbn_pin_wakeup_mask            : 10; /* [13: 4],        r/w,        0x0 */
            uint32_t hbn_pin_wakeup_option          :  1; /* [   14],        r/w,        0x0 */
            uint32_t reserved_15                    :  1; /* [   15],       rsvd,        0x0 */
            uint32_t reg_en_hw_pu_pd                :  1; /* [   16],        r/w,        0x1 */
            uint32_t reserved_17                    :  1; /* [   17],       rsvd,        0x0 */
            uint32_t irq_bod_en                     :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t irq_acomp0_en                  :  2; /* [21:20],        r/w,        0x0 */
            uint32_t irq_acomp1_en                  :  2; /* [23:22],        r/w,        0x0 */
            uint32_t pin_wakeup_dly_sel             :  3; /* [26:24],        r/w,        0x3 */
            uint32_t pin_wakeup_dly_en              :  1; /* [   27],        r/w,        0x0 */
            uint32_t pin_wakeup_dly_unit            :  2; /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_IRQ_MODE;

    /* 0x18 : HBN_IRQ_STAT */
    union {
        struct {
            uint32_t irq_stat                       : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_IRQ_STAT;

    /* 0x1C : HBN_IRQ_CLR */
    union {
        struct {
            uint32_t irq_clr                        : 32; /* [31: 0],          w,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_IRQ_CLR;

    /* 0x20 : HBN_PIR_CFG */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_PIR_CFG;

    /* 0x24 : HBN_PIR_VTH */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_PIR_VTH;

    /* 0x28 : HBN_PIR_INTERVAL */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_PIR_INTERVAL;

    /* 0x2C : HBN_MISC */
    union {
        struct {
            uint32_t bod_sel                        :  1; /* [    0],        r/w,        0x0 */
            uint32_t bod_vth                        :  3; /* [ 3: 1],        r/w,        0x4 */
            uint32_t pu_bod                         :  1; /* [    4],        r/w,        0x1 */
            uint32_t r_bod_out                      :  1; /* [    5],          r,        0x0 */
            uint32_t reserved_6_10                  :  5; /* [10: 6],       rsvd,        0x0 */
            uint32_t vdd14_bond_option_enb_aon      :  1; /* [   11],        r/w,        0x0 */
            uint32_t gpio_wakeup_out_aon            :  3; /* [14:12],          r,        0x0 */
            uint32_t reserved_15                    :  1; /* [   15],       rsvd,        0x0 */
            uint32_t gpio_wakeup_en_aon             :  3; /* [18:16],        r/w,        0x0 */
            uint32_t sw_gpio_latch_en_aon           :  3; /* [21:19],        r/w,        0x0 */
            uint32_t reserved_22_31                 : 10; /* [31:22],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_MISC;

    /* 0x30 : HBN_GLB */
    union {
        struct {
            uint32_t hbn_root_clk_sel               :  2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t hbn_uart_clk_sel               :  1; /* [    2],        r/w,        0x0 */
            uint32_t hbn_f32k_sel                   :  2; /* [ 4: 3],        r/w,        0x0 */
            uint32_t hbn_pu_rc32k                   :  1; /* [    5],        r/w,        0x1 */
            uint32_t hbn_reset_event                :  7; /* [12: 6],          r,        0x0 */
            uint32_t hbn_clear_reset_event          :  1; /* [   13],        r/w,        0x0 */
            uint32_t en_hbn_watchdog_timeout        :  1; /* [   14],        r/w,        0x0 */
            uint32_t hbn_uart_clk_sel2              :  1; /* [   15],        r/w,        0x0 */
            uint32_t sw_ldo11soc_vout_sel_aon       :  4; /* [19:16],        r/w,        0xa */
            uint32_t sw_ldo11_rt_slave_en_aon       :  1; /* [   20],        r/w,        0x1 */
            uint32_t sw_ldo11_rt_direct_conn_en_aon :  1; /* [   21],        r/w,        0x0 */
            uint32_t en_hbn_wdt_reset_as_swrst      :  1; /* [   22],        r/w,        0x0 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t sw_ldo11_ild_sel_aon           :  4; /* [27:24],        r/w,        0x4 */
            uint32_t sw_ldo11_aon_vout_sel          :  4; /* [31:28],        r/w,        0xa */
        }BF;
        uint32_t WORD;
    } HBN_GLB;

    /* 0x34 : HBN_SRAM */
    union {
        struct {
            uint32_t retram_ema                     :  3; /* [ 2: 0],        r/w,        0x3 */
            uint32_t retram_emaw                    :  2; /* [ 4: 3],        r/w,        0x1 */
            uint32_t reserved_5                     :  1; /* [    5],       rsvd,        0x0 */
            uint32_t retram_ret                     :  1; /* [    6],        r/w,        0x0 */
            uint32_t retram_slp                     :  1; /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_31                  : 24; /* [31: 8],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_SRAM;

