bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/hbn_reg.h
    /* 0x38 : HBN_PAD_CTRL_0 */
    union {
        struct {
            uint32_t reg_aon_gpio_ie_smt            :  7; /* [ 6: 0],        r/w,        0x0 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_aon_gpio_drv               :  2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reg_aon_led_sel                :  9; /* [18:10],        r/w,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t reg_en_aon_ctrl_gpio           :  7; /* [26:20],        r/w,       0x60 */
            uint32_t reserved_27                    :  1; /* [   27],       rsvd,        0x0 */
            uint32_t cr_gpio_keep_en                :  3; /* [30:28],        r/w,        0x0 */
            uint32_t reg_aon_gpio_iso_mode          :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_PAD_CTRL_0;

    /* 0x3C : HBN_PAD_CTRL_1 */
    union {
        struct {
            uint32_t reg_aon_gpio_oe                :  7; /* [ 6: 0],        r/w,        0x0 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_aon_gpio_pd                :  7; /* [14: 8],        r/w,        0x0 */
            uint32_t reserved_15                    :  1; /* [   15],       rsvd,        0x0 */
            uint32_t reg_aon_gpio_pu                :  7; /* [22:16],        r/w,        0x0 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_aon_gpio_o                 :  7; /* [30:24],        r/w,        0x0 */
            uint32_t reg_sel_aon_gpio_o             :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_PAD_CTRL_1;

    /* 0x40  reserved */
    uint8_t RESERVED0x40[192];

    /* 0x100 : HBN_RSV0 */
    union {
        struct {
            uint32_t HBN_RSV0                       : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_RSV0;

    /* 0x104 : HBN_RSV1 */
    union {
        struct {
            uint32_t HBN_RSV1                       : 32; /* [31: 0],        r/w, 0xffffffff */
        }BF;
        uint32_t WORD;
    } HBN_RSV1;

    /* 0x108 : HBN_RSV2 */
    union {
        struct {
            uint32_t HBN_RSV2                       : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } HBN_RSV2;

    /* 0x10C : HBN_RSV3 */
    union {
        struct {
            uint32_t HBN_RSV3                       : 32; /* [31: 0],        r/w, 0xffffffff */
        }BF;
        uint32_t WORD;
    } HBN_RSV3;

    /* 0x110  reserved */
    uint8_t RESERVED0x110[240];

    /* 0x200 : rc32k_ctrl0 */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t rc32k_rdy                      :  1; /* [    1],          r,        0x1 */
            uint32_t reserved_2_19                  : 18; /* [19: 2],       rsvd,        0x0 */
            uint32_t rc32k_cal_en                   :  1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_27                 :  7; /* [27:21],       rsvd,        0x0 */
            uint32_t rc32k_cap_sel                  :  4; /* [31:28],        r/w,        0x8 */
        }BF;
        uint32_t WORD;
    } rc32k_ctrl0;

    /* 0x204 : xtal32k */
    union {
        struct {
            uint32_t xtal32k_hiz_en                 :  1; /* [    0],        r/w,        0x1 */
            uint32_t xtal32k_lowv_en                :  1; /* [    1],        r/w,        0x0 */
            uint32_t xtal32k_ext_sel                :  1; /* [    2],        r/w,        0x0 */
            uint32_t xtal32k_amp_ctrl               :  2; /* [ 4: 3],        r/w,        0x1 */
            uint32_t xtal32k_reg                    :  2; /* [ 6: 5],        r/w,        0x1 */
            uint32_t xtal32k_outbuf_stre            :  1; /* [    7],        r/w,        0x0 */
            uint32_t xtal32k_otf_short              :  1; /* [    8],        r/w,        0x0 */
            uint32_t xtal32k_inv_stre               :  2; /* [10: 9],        r/w,        0x1 */
            uint32_t xtal32k_capbank                :  6; /* [16:11],        r/w,       0x20 */
            uint32_t xtal32k_ac_cap_short           :  1; /* [   17],        r/w,        0x1 */
            uint32_t pu_xtal32k_buf                 :  1; /* [   18],        r/w,        0x1 */
            uint32_t pu_xtal32k                     :  1; /* [   19],        r/w,        0x1 */
            uint32_t reserved_20_31                 : 12; /* [31:20],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } xtal32k;

    /* 0x208 : rc32k_ctrl1 */
    union {
        struct {
            uint32_t rc32k_code_fr_cal              : 13; /* [12: 0],        r/w,     0x1000 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t rc32k_sdm_rstb                 :  1; /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_19                 :  3; /* [19:17],       rsvd,        0x0 */
            uint32_t rc32k_sdm_bypass               :  1; /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_27                 :  7; /* [27:21],       rsvd,        0x0 */
            uint32_t aon_rc32k_resv                 :  4; /* [31:28],        r/w,        0xb */
        }BF;
        uint32_t WORD;
    } rc32k_ctrl1;

};

typedef volatile struct hbn_reg hbn_reg_t;


#endif  /* __HBN_REG_H__ */
